{
  "lessonLanguage": "en",
  "lessonTitle": "Lesson: Drawing Armenian Letters",
  "lessonId": "ai-armenian-letters-test",
  "stages": [
    {
      "stageId": "letters_intro",
      "type": "explanation",
      "headline": "Let's learn how to draw the first three letters of the Armenian alphabet.",
      "studentInput": false
    },
    {
      "stageId": "draw_ayb",
      "type": "question_math_solution",
      "headline": "This is the letter Ա (Ayb). Please try drawing it.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Armenian_letter_Ayb.svg/1200px-Armenian_letter_Ayb.svg.png",
      "studentInput": true,
      "problemText": "The student was asked to draw the Armenian letter Ա (Ayb).",
      "correctAnswer": "The letter Ա (Ayb) looks like two vertical arcs connected in the middle, similar to a cursive 'u' shape with an open top.",
      "customInstructions": "The student is learning. Be encouraging. As long as their drawing resembles the general shape of the letter Ա (two connected arcs), mark it as correct. Don't be strict about perfect curves or proportions. Praise their effort."
    },
    {
      "stageId": "draw_ben",
      "type": "question_math_solution",
      "headline": "Excellent! Next is the letter Բ (Ben). Give it a try.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Armenian_letter_Ben.svg/1200px-Armenian_letter_Ben.svg.png",
      "studentInput": true,
      "problemText": "The student was asked to draw the Armenian letter Բ (Ben).",
      "correctAnswer": "The letter Բ (Ben) is a rounded shape that is open on the right side, somewhat like a backwards 'C' with a flat bottom.",
      "customInstructions": "Be encouraging. If the student's drawing is a single, continuous curve that is open on the right side, accept it as correct. Focus on the overall shape, not on making it perfect."
    },
    {
      "stageId": "draw_gim",
      "type": "question_math_solution",
      "headline": "Great work! Finally, let's draw the letter Գ (Gim).",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Armenian_letter_Gim.svg/1200px-Armenian_letter_Gim.svg.png",
      "studentInput": true,
      "problemText": "The student was asked to draw the Armenian letter Գ (Gim).",
      "correctAnswer": "The letter Գ (Gim) looks like a semi-circle or a wide 'U' shape with a small vertical line extending downwards from the right tip.",
      "customInstructions": "Be encouraging. The key features are the main curved body and the small tail on the right. If the student draws both of these, mark it as correct. Their drawing does not need to be flawless."
    },
    {
      "stageId": "letters_conclusion",
      "type": "explanation",
      "headline": "Շատ լավ (Shat lav) - Very good! You've learned the first three letters.",
      "studentInput": false
    }
  ]
}
