{
  "lessonLanguage": "en",
  "lessonTitle": "Lesson: Drawing Basic Shapes",
  "lessonId": "ai-shape-drawing-test",
  "stages": [
    {
      "stageId": "shapes_intro",
      "type": "explanation",
      "headline": "Let's test the AI's ability to recognize shapes. I'll ask you to draw a few things.",
      "studentInput": false
    },
    {
      "stageId": "draw_a_square",
      "type": "question_math_solution",
      "headline": "First, please draw a square.",
      "studentInput": true,
      "problemText": "The student was asked to draw a square.",
      "correctAnswer": "A four-sided shape with equal sides and four right (90-degree) angles.",
      "solutionSteps": "The student should draw a closed shape with four straight lines of roughly equal length that connect at right angles.",
      "customInstructions": "Your primary goal is to be encouraging. The student is drawing by hand, so do not expect perfection. If the student draws a closed, four-sided shape that is roughly square-like, mark it as 'correct'. Your feedback should be positive, like 'That looks great!' or 'Excellent, that's a great looking square!' Do NOT criticize small imperfections in the angles or side lengths."
    },
    {
      "stageId": "draw_a_triangle",
      "type": "question_math_solution",
      "headline": "Great. Now, please draw a triangle.",
      "studentInput": true,
      "problemText": "The student was asked to draw a triangle.",
      "correctAnswer": "A three-sided shape.",
      "solutionSteps": "The student should draw a closed shape with three straight lines.",
      "customInstructions": "Be very encouraging. As long as the student draws any closed shape with three sides, mark it as 'correct'. The lines do not need to be perfectly straight. Praise their effort."
    },
    {
      "stageId": "draw_a_circle",
      "type": "question_math_solution",
      "headline": "Excellent! Finally, please draw a circle.",
      "studentInput": true,
      "problemText": "The student was asked to draw a circle.",
      "correctAnswer": "A perfectly round shape with no corners.",
      "solutionSteps": "The student should draw a single, continuous curved line that connects back to itself, with all points roughly equidistant from the center.",
      "customInstructions": "Be very encouraging. If the student's drawing is a closed loop and is generally round, mark it as 'correct'. It does not need to be a perfect circle. Your feedback should be positive and praise their work."
    },
    {
      "stageId": "shapes_conclusion",
      "type": "explanation",
      "headline": "Fantastic work! The test is complete.",
      "studentInput": false
    }
  ]
}
