{
  "lessonLanguage": "en",
  "lessonTitle": "Lesson: Drawing Basic Shapes",
  "lessonId": "ai-shape-drawing-test",
  "stages": [
    {
      "stageId": "shapes_intro",
      "type": "explanation",
      "headline": "Let's test the AI's ability to recognize shapes. I'll ask you to draw a few things.",
      "studentInput": false
    },
    {
      "stageId": "draw_a_square",
      "type": "question_math_solution",
      "headline": "First, please draw a square.",
      "studentInput": true,
      "problemText": "The student was asked to draw a square.",
      "correctAnswer": "A four-sided shape with equal sides and four right (90-degree) angles.",
      "solutionSteps": "The student should draw a closed shape with four straight lines of roughly equal length that connect at right angles.",
      "customInstructions": "You must be encouraging. The student is drawing by hand, so their lines won't be perfect. Your rule is: if the drawing is a closed shape with FOUR sides, you MUST mark it as 'correct' and give positive feedback. Only mark it 'incorrect' if it's a completely different shape (like a circle or a triangle). Do NOT criticize imperfect angles or unequal sides."
    },
    {
      "stageId": "draw_a_triangle",
      "type": "question_math_solution",
      "headline": "Great. Now, please draw a triangle.",
      "studentInput": true,
      "problemText": "The student was asked to draw a triangle.",
      "correctAnswer": "A three-sided shape.",
      "solutionSteps": "The student should draw a closed shape with three straight lines.",
      "customInstructions": "Be very encouraging. Your rule is: if the drawing is a closed shape with THREE sides, you MUST mark it as 'correct'. Do not be strict about the lines being straight. Only mark it 'incorrect' if it has more or fewer than three sides."
    },
    {
      "stageId": "draw_a_circle",
      "type": "question_math_solution",
      "headline": "Excellent! Finally, please draw a circle.",
      "studentInput": true,
      "problemText": "The student was asked to draw a circle.",
      "correctAnswer": "A perfectly round shape with no corners.",
      "solutionSteps": "The student should draw a single, continuous curved line that connects back to itself, with all points roughly equidistant from the center.",
      "customInstructions": "Be very encouraging. Your rule is: if the drawing is a single closed loop, you MUST mark it as 'correct'. It does not need to be perfectly round. Only mark it 'incorrect' if it's a different shape entirely (like a square)."
    },
    {
      "stageId": "shapes_conclusion",
      "type": "explanation",
      "headline": "Fantastic work! The test is complete.",
      "studentInput": false
    }
  ]
}
