{
  "lessonLanguage": "en",
  "lessonTitle": "Lesson: Drawing Basic Shapes",
  "lessonId": "ai-shape-drawing-test",
  "stages": [
    {
      "stageId": "shapes_intro",
      "type": "explanation",
      "headline": "Let's test the AI's ability to recognize shapes. I'll ask you to draw a few things.",
      "studentInput": false
    },
    {
      "stageId": "draw_a_square",
      "type": "question_math_solution",
      "headline": "First, please draw a square.",
      "studentInput": true,
      "problemText": "The student was asked to draw a square.",
      "correctAnswer": "A four-sided shape with equal sides and four right (90-degree) angles.",
      "solutionSteps": "The student should draw a closed shape with four straight lines of roughly equal length that connect at right angles.",
      "customInstructions": "Be encouraging. If the student draws something that looks like a square but isn't perfect, praise their attempt and gently suggest one improvement. For example, 'That's a great looking four-sided shape! To make it a perfect square, try to make all the sides the same length.'"
    },
    {
      "stageId": "draw_a_triangle",
      "type": "question_math_solution",
      "headline": "Great. Now, please draw a triangle.",
      "studentInput": true,
      "problemText": "The student was asked to draw a triangle.",
      "correctAnswer": "A three-sided shape.",
      "solutionSteps": "The student should draw a closed shape with three straight lines.",
      "customInstructions": "Be encouraging. As long as the student draws a closed, three-sided shape, mark it as correct. Don't be too strict about the lines being perfectly straight."
    },
    {
      "stageId": "draw_a_circle",
      "type": "question_math_solution",
      "headline": "Excellent! Finally, please draw a circle.",
      "studentInput": true,
      "problemText": "The student was asked to draw a circle.",
      "correctAnswer": "A perfectly round shape with no corners.",
      "solutionSteps": "The student should draw a single, continuous curved line that connects back to itself, with all points roughly equidistant from the center.",
      "customInstructions": "Be encouraging. If the student's drawing is a closed loop and generally round, accept it. It doesn't need to be a perfect circle. Praise their effort."
    },
    {
      "stageId": "shapes_conclusion",
      "type": "explanation",
      "headline": "Fantastic work! The test is complete.",
      "studentInput": false
    }
  ]
}
