{
  "lessonLanguage": "en",
  "lessonTitle": "Lesson: Drawing English Letters",
  "lessonId": "ai-english-letters-test",
  "stages": [
    {
      "stageId": "letters_intro",
      "type": "explanation",
      "headline": "Let's practice drawing a few English letters.",
      "studentInput": false
    },
    {
      "stageId": "draw_a",
      "type": "question_math_solution",
      "headline": "Let's start with the letter A. Please draw it.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Latin_A.svg/1200px-Latin_A.svg.png",
      "studentInput": true,
      "problemText": "The student was asked to draw the English letter A.",
      "correctAnswer": "The letter A consists of two diagonal lines meeting at a point at the top, with a horizontal bar connecting them in the middle.",
      "customInstructions": "Your goal is to be encouraging. As long as the student's drawing has the three distinct strokes of a capital 'A', please mark it as 'correct'. Do not be strict about perfect lines or angles. Praise their effort."
    },
    {
      "stageId": "draw_b",
      "type": "question_math_solution",
      "headline": "Great! Now, let's draw the letter B.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/Latin_B.svg/1200px-Latin_B.svg.png",
      "studentInput": true,
      "problemText": "The student was asked to draw the English letter B.",
      "correctAnswer": "The letter B is made of a vertical line on the left, with two rounded semi-circles attached to the right side.",
      "customInstructions": "Be very encouraging. If the student's drawing has a straight vertical line and two bumps on the right, accept it as correct. The shape of the bumps does not need to be perfect. Focus on recognizing the core components."
    },
    {
      "stageId": "draw_c",
      "type": "question_math_solution",
      "headline": "Excellent! Let's do one more: the letter C.",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2b/Latin_C.svg/1200px-Latin_C.svg.png",
      "studentInput": true,
      "problemText": "The student was asked to draw the English letter C.",
      "correctAnswer": "The letter C is a single, continuous curve that is open on the right side, like an incomplete circle.",
      "customInstructions": "Be encouraging. If the student draws a single curved line that is open on the right, mark it as 'correct'. The curve does not need to be perfectly circular. Praise their work."
    },
    {
      "stageId": "letters_conclusion",
      "type": "explanation",
      "headline": "Wonderful job! You've practiced three letters.",
      "studentInput": false
    }
  ]
}
